#include<graphics.h>
#include<iostream>
#include<windows.h>
int main(void){
	//初始图像界面600.340
	initgraph(1000,667);
	//加载图片
	loadimage(0,_T("asd.jfif"));
	//设置文本字体
	settextstyle(60,0,_T("微软雅黑"));
	//设置字体颜色
	settextcolor(RGB(255,255,0));
	//画一个空心矩形，左上角坐标（600,80）右下角（950,160）
	rectangle(600,80,950,160);
	//在矩形内打印文本
	outtextxy(600,90,_T("1.网站404攻击"));

	//画一个空心矩形，左上角坐标（600,80）右下角（950,160）
	rectangle(600,180,950,260);
	//在矩形内打印文本
	outtextxy(600,190,_T("2.网站篡改攻击"));
	
	//画一个空心矩形，左上角坐标（600,80）右下角（950,160）
	rectangle(600,280,950,360);
	//在矩形内打印文本
	outtextxy(600,290,_T("3.网站攻击记录"));
	//画一个空心矩形，左上角坐标（600,80）右下角（950,160）
	rectangle(600,380,950,460);
	//在矩形内打印文本
	outtextxy(600,390,_T("4.DNS攻击"));
	//画一个空心矩形，左上角坐标（600,80）右下角（950,160）
	rectangle(600,480,950,560);
	//在矩形内打印文本
	outtextxy(600,490,_T("5.服务器攻击"));
	//画一个空心矩形，左上角坐标（600,80）右下角（950,160）
	rectangle(600,580,950,660);
	//在矩形内打印文本
	outtextxy(600,590,_T("5.退出"));





	system("pause");
	return 0;
}